### 2000년도 총 출생수

2000년도에 태어난 신생아의 정보가 들어있는 year2000을 분석하여, 총 출생수가 출력되는 함수 생성하기

In [2]:
import os
def baby():
    ret=[]
    total=0
    file = 'c:/Users/sol/Desktop/python_test/baby/year2000.txt'

  #1
    filename = os.path.basename('c:/Users/sol/Desktop/python_test/baby/year2000.txt')
    # print(filename) year2000.txt
    filename = filename.split('.')[0]  
       
  #2
    with open(file,'r') as f:
        data=f.readlines()
        for d in data:
            name_sum = d.split(',')[2]
            total += int(name_sum)

    ret.append( (filename, total) )
    return ret

print(baby())

[('year2000', 3775662)]

### 2000년도 남아, 여아, 총 출생수

In [4]:
import os
def baby():
    ret=[]
    f_cn = 0
    m_cn = 0
    file = 'c:/Users/sol/Desktop/python_test/baby/year2000.txt'
   
    filename = os.path.basename('c:/Users/sol/Desktop/python_test/baby/year2000.txt')
    filename = filename.split('.')[0]

    with open(file,'r') as f:
        data=f.readlines()
        for d in data:
            birth = d.split(',')
            if birth[1] == 'F':
                f_cn += int(birth[2])
            else:
                m_cn += int(birth[2])

        ret.append( (filename,'F',f_cn) )
        ret.append( (filename,'M',m_cn) )
        ret.append( (filename,'TOTAL',f_cn + m_cn) )
    return ret

print(baby())

[('year2000', 'F', 1813960), ('year2000', 'M', 1961702), ('year2000', 'TOTAL', 3775662)]

In [5]:
a=baby()
for i in a:
    print(i[1:3])

('F', 1813960)
('M', 1961702)
('TOTAL', 3775662)

### 연도별 출생수 (2000~2010년도)

In [14]:
def baby():
    ret=[]
    for y in range(2000,2011):
        total=0
        filename='c:/Users/sol/Desktop/python_test/baby/year%d.txt'%y

        with open(filename,'r') as f:
            data=f.readlines()
            for d in data:
                name_sum = d.split(',')[2]
                total += int(name_sum)
            ret.append((y,total))
    return ret

print(baby())

[(2000, 3775662), (2001, 3738782), (2002, 3733299), (2003, 3796845), (2004, 3814562), (2005, 3837175), (2006, 3946702), (2007, 3986130), (2008, 3915955), (2009, 3801002), (2010, 3657392)]

In [16]:
result = baby()
for year, name_sum in result:  
    print(year,name_sum)

2000 3775662
2001 3738782
2002 3733299
2003 3796845
2004 3814562
2005 3837175
2006 3946702
2007 3986130
2008 3915955
2009 3801002
2010 3657392

In [19]:
import os
import glob
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

all_data = pd.DataFrame()
for f in glob.glob("c:/Users/sol/Desktop/python_test/baby/year*.txt"):
    filename = os.path.basename(f)
    filename = filename.split('.')[0]

    df = pd.read_csv(f, names=['name','sex','name_sum'])
    all_data = all_data.append(df)
    print(filename[4:], all_data['name_sum'].sum())

2000 3775662
2001 7514444
2002 11247743
2003 15044588
2004 18859150
2005 22696325
2006 26643027
2007 30629157
2008 34545112
2009 38346114
2010 42003506

### 정제한 데이터 파일생성(.txt)

In [20]:
with open('c:/Users/sol/Desktop/python_test/baby/year.txt','w') as f:
    for year, name_sum in result:
        data = '%s,%s\n'%(year, name_sum)
        print(data)
        f.write(data)

2000,3775662

2001,3738782

2002,3733299

2003,3796845

2004,3814562

2005,3837175

2006,3946702

2007,3986130

2008,3915955

2009,3801002

2010,3657392

### 2000년도에 태어난 아이 이름 상위 10개 / 성별 상위 5개

In [31]:
import pandas as pd
year2000 = pd.read_csv('c:/Users/sol/Desktop/python_test/baby/year2000.txt', names=['name','sex','name_sum'])

def top(df, n=5, column='name_sum'): #인수값 집어넣지 않으면 자동으로 5
    return df.sort_values(by=column, ascending=False)[:n]  #false말고 [:-n]해도 동일
                                                           #인수값으로 받은 컬럼(없다면 자동으로 birth 기준)
top(year2000, n=10) # n값 명시 안하면 5

              name sex  name_sum
17649        Jacob   M     34454
17650      Michael   M     32016
17651      Matthew   M     28563
17652       Joshua   M     27522
0            Emily   F     25949
17653  Christopher   M     24916
17654     Nicholas   M     24644
17655       Andrew   M     23622
1           Hannah   F     23066
17656       Joseph   M     22806

In [32]:
year2000.groupby('sex').apply(top)

                  name sex  name_sum
sex
F   0            Emily   F     25949
    1           Hannah   F     23066
    2          Madison   F     19965
    3           Ashley   F     17991
    4            Sarah   F     17677
M   17649        Jacob   M     34454
    17650      Michael   M     32016
    17651      Matthew   M     28563
    17652       Joshua   M     27522
    17653  Christopher   M     24916

In [33]:
import os
import glob
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

all_data= pd.DataFrame()
for f in glob.glob("c:/Users/sol/Desktop/python_test/baby/year*.txt"):
    name= os.path.basename(f)
    name= name.split('.')[0]

    df= pd.read_csv(f,names=['name','sex','name_sum'])
    all_data=all_data.append(df)
 
def top(df,n=5,column= 'name_sum'):
     return df.sort_values(by= column, ascending= False)[:n]

print(all_data.groupby('sex').apply(top))

                  name      sex  name_sum
sex
3657392 10        2010  3657392       NaN
3733299 2         2002  3733299       NaN
3738782 1         2001  3738782       NaN
3775662 0         2000  3775662       NaN
3796845 3         2003  3796845       NaN
3801002 9         2009  3801002       NaN
3814562 4         2004  3814562       NaN
3837175 5         2005  3837175       NaN
3915955 8         2008  3915955       NaN
3946702 6         2006  3946702       NaN
3986130 7         2007  3986130       NaN
F       0        Emily        F   25949.0
        0        Emily        F   25678.0
        0        Emily        F   25048.0
        0        Emily        F   25009.0
        0        Emily        F   24450.0
M       17649    Jacob        M   34454.0
        17962    Jacob        M   32509.0
        17650  Michael        M   32016.0
        18073    Jacob        M   30541.0
        17963  Michael        M   29666.0